openshwprojects/OpenBK7231T_App/src/libraries/ESP32_Display_Panel/src/drivers/lcd/esp_panel_lcd.cpp
/*
 * SPDX-FileCopyrightText: 2023-2025 Espressif Systems (Shanghai) CO LTD
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#include <algorithm>
#include <memory>
#include <numeric>
#include "sdkconfig.h"
#include "esp_heap_caps.h"
#include "esp_lcd_panel_ops.h"
#include "esp_lcd_panel_io.h"
#include "esp_memory_utils.h"
#include "driver/spi_master.h"
#include "utils/esp_panel_utils_log.h"
#include "esp_panel_lcd.hpp"

namespace esp_panel::drivers {

void LCD::BasicBusSpecification::print(utils::string bus_name) const
{
    ESP_UTILS_LOG_TRACE_ENTER_WITH_THIS();

    if (bus_name.empty()) {
        ESP_UTILS_LOGI("\n\t{Bus specification}");
    } else {
        ESP_UTILS_LOGI("\n\t{%s Bus specification}", bus_name.c_str());
    }
    ESP_UTILS_LOGI(
        "\n\t\t-> [x_coord_align]: %d"
        "\n\t\t-> [y_coord_align]: %d"
        "\n\t\t-> [color_bits]: %s"
        "\n\t\t-> {functions}"
        "\n\t\t\t-> [invert_color]: %d"
        "\n\t\t\t-> [mirror_x]: %d"
        "\n\t\t\t-> [mirror_y]: %d"
        "\n\t\t\t-> [swap_xy]: %d"
        "\n\t\t\t-> [gap]: %d"
        "\n\t\t\t-> [display_on_off]: %d"
        , static_cast<int>(x_coord_align)
        , static_cast<int>(y_coord_align)
        , getColorBitsString().c_str()
        , static_cast<int>(isFunctionValid(Function::FUNC_INVERT_COLOR))
        , static_cast<int>(isFunctionValid(Function::FUNC_MIRROR_X))
        , static_cast<int>(isFunctionValid(Function::FUNC_MIRROR_Y))
        , static_cast<int>(isFunctionValid(Function::FUNC_SWAP_XY))
        , static_cast<int>(isFunctionValid(Function::FUNC_GAP))
        , static_cast<int>(isFunctionValid(Function::FUNC_DISPLAY_ON_OFF))
    );

    ESP_UTILS_LOG_TRACE_EXIT_WITH_THIS();
}

void LCD::BasicAttributes::print() const
{
    ESP_UTILS_LOG_TRACE_ENTER_WITH_THIS();

    ESP_UTILS_LOGI("\n\t{Basic attributes}");
    ESP_UTILS_LOGI("\n\t\t-> [name]: %s", name);
    basic_bus_spec.print();

    ESP_UTILS_LOG_TRACE_EXIT_WITH_THIS();
}

utils::string LCD::BasicBusSpecification::getColorBitsString() const
{
    auto color_bits = getColorBitsVector();
    utils::string result = "";
    for (auto &color_bit : color_bits) {
        if (!result.empty()) {
            result += ", ";
        }
        result += utils::string(std::to_string(color_bit).c_str());
    }

    return result;
}

utils::vector<int> LCD::BasicBusSpecification::getColorBitsVector() const
{
    utils::vector<int> result;
    for (int i = 0; i < COLOR_BITS_MAX; i++) {
        if (color_bits.test(i)) {
            switch (i) {
            case COLOR_BITS_RGB565_16:
                result.push_back(ESP_PANEL_LCD_COLOR_BITS_RGB565);
                break;
            case COLOR_BITS_RGB666_18:
                result.push_back(ESP_PANEL_LCD_COLOR_BITS_RGB666);
                break;
            case COLOR_BITS_RGB888_24:
                result.push_back(ESP_PANEL_LCD_COLOR_BITS_RGB888);
                break;
            default:
                break;
            }
        }
    }

    return result;
}

void LCD::Config::convertPartialToFull()
{
    ESP_UTILS_LOG_TRACE_ENTER_WITH_THIS();

    if (std::holds_alternative<DevicePartialConfig>(device)) {
#if ESP_UTILS_CONF_LOG_LEVEL == ESP_UTILS_LOG_LEVEL_DEBUG
        printDeviceConfig();
#endif // ESP_UTILS_LOG_LEVEL_DEBUG
        auto &config = std::get<DevicePartialConfig>(device);
        device = DeviceFullConfig{
            .reset_gpio_num = config.reset_gpio_num,
            .rgb_ele_order = static_cast<lcd_rgb_element_order_t>(config.rgb_ele_order),
            .data_endian = LCD_RGB_DATA_ENDIAN_BIG,
            .bits_per_pixel = static_cast<uint32_t>(config.bits_per_pixel),
            .flags = {
                .reset_active_high = config.flags_reset_active_high,
            },
            .vendor_config = nullptr,
        };
    }

    if (std::holds_alternative<VendorPartialConfig>(vendor)) {
#if ESP_UTILS_CONF_LOG_LEVEL == ESP_UTILS_LOG_LEVEL_DEBUG
        printVendorConfig();
#endif // ESP_UTILS_LOG_LEVEL_DEBUG
        auto &config = std::get<VendorPartialConfig>(vendor);
        vendor = VendorFullConfig{
            .hor_res = config.hor_res,
            .ver_res = config.ver_res,
            .init_cmds = config.init_cmds,
            .init_cmds_size = static_cast<unsigned int>(config.init_cmds_size),
            .flags = {
                .mirror_by_cmd = config.flags_mirror_by_cmd,
                .enable_io_multiplex = config.flags_enable_io_multiplex,
            },
        };
    }

    ESP_UTILS_LOG_TRACE_EXIT_WITH_THIS();
}

void LCD::Config::printDeviceConfig() const
{
    ESP_UTILS_LOG_TRACE_ENTER_WITH_THIS();

    if (std::holds_alternative<DeviceFullConfig>(device)) {
        auto &config = std::get<DeviceFullConfig>(device);
        ESP_UTILS_LOGI(
            "\n\t{Device config}[full]"
            "\n\t\t-> [reset_gpio_num]: %d"
            "\n\t\t-> [rgb_ele_order]: %d"
            "\n\t\t-> [bits_per_pixel]: %d"
            "\n\t\t-> {flags}"
            "\n\t\t\t-> [reset_active_high]: %d"
            , config.reset_gpio_num
            , config.rgb_ele_order
            , static_cast<int>(config.bits_per_pixel)
            , config.flags.reset_active_high
        );
    } else {
        auto &config = std::get<DevicePartialConfig>(device);
        ESP_UTILS_LOGI(
            "\n\t{Device config}[partial]"
            "\n\t\t-> [reset_gpio_num]: %d"
            "\n\t\t-> [rgb_ele_order]: %d"
            "\n\t\t-> [bits_per_pixel]: %d"
            "\n\t\t-> [flags_reset_active_high]: %d"
            , config.reset_gpio_num
            , config.rgb_ele_order
            , config.bits_per_pixel
            , config.flags_reset_active_high
        );
    }

    ESP_UTILS_LOG_TRACE_EXIT_WITH_THIS();
}

void LCD::Config::printVendorConfig() const
{
    ESP_UTILS_LOG_TRACE_ENTER_WITH_THIS();

    if (std::holds_alternative<VendorFullConfig>(vendor)) {
        auto &config = std::get<VendorFullConfig>(vendor);
        ESP_UTILS_LOGI(
            "\n\t{Vendor config}[full]"
            "\n\t\t-> [hor_res]: %d"
            "\n\t\t-> [ver_res]: %d"
            "\n\t\t-> [init_cmds]: %p"
            "\n\t\t-> [init_cmds_size]: %d"
#if ESP_PANEL_DRIVERS_BUS_ENABLE_RGB
            "\n\t\t-> [rgb_config]: %p"
#endif // ESP_PANEL_DRIVERS_BUS_ENABLE_RGB
#if ESP_PANEL_DRIVERS_BUS_ENABLE_MIPI_DSI
            "\n\t\t-> [mipi_config]"
            "\n\t\t\t-> [lane_num]: %d"
            "\n\t\t\t-> [dsi_bus]: %p"
            "\n\t\t\t-> [dpi_config]: %p"
#endif // ESP_PANEL_DRIVERS_BUS_ENABLE_MIPI_DSI
            , config.hor_res
            , config.ver_res
            , config.init_cmds
            , config.init_cmds_size
#if ESP_PANEL_DRIVERS_BUS_ENABLE_RGB
            , config.rgb_config
#endif // ESP_PANEL_DRIVERS_BUS_ENABLE_RGB
#if ESP_PANEL_DRIVERS_BUS_ENABLE_MIPI_DSI
            , config.mipi_config.lane_num
            , config.mipi_config.dsi_bus
            , config.mipi_config.dpi_config
#endif // ESP_PANEL_DRIVERS_BUS_ENABLE_MIPI_DSI
        );
        ESP_UTILS_LOGI(
            "\n\t\t-> {flags}"
            "\n\t\t\t-> [mirror_by_cmd]: %d"
            "\n\t\t\t-> [enable_io_multiplex]: %d"
            "\n\t\t\t-> [use_spi_interface]: %d"
            "\n\t\t\t-> [use_qspi_interface]: %d"
            "\n\t\t\t-> [use_rgb_interface]: %d"
            "\n\t\t\t-> [use_mipi_interface]: %d"
            , config.flags.mirror_by_cmd
            , config.flags.enable_io_multiplex
            , config.flags.use_spi_interface
            , config.flags.use_qspi_interface
            , config.flags.use_rgb_interface
            , config.flags.use_mipi_interface
        );
    } else {
        auto &config = std::get<VendorPartialConfig>(vendor);
        ESP_UTILS_LOGI(
            "\n\t{Vendor config}[partial]"
            "\n\t\t-> [hor_res]: %d"
            "\n\t\t-> [ver_res]: %d"
            "\n\t\t-> [init_cmds]: %p"
            "\n\t\t-> [init_cmds_size]: %d"
            "\n\t\t-> [flags_mirror_by_cmd]: %d"
            "\n\t\t-> [flags_enable_io_multiplex]: %d"
            , config.hor_res
            , config.ver_res
            , config.init_cmds
            , config.init_cmds_size
            , config.flags_mirror_by_cmd
            , config.flags_enable_io_multiplex
        );
    }

    ESP_UTILS_LOG_TRACE_EXIT_WITH_THIS();
}

