openshwprojects/OpenBK7231T_App/src/libraries/ESP32_Display_Panel/src/drivers/lcd/esp_panel_lcd.cpp
bool LCD::configVendorCommands(const esp_panel_lcd_vendor_init_cmd_t init_cmd[], uint32_t init_cmd_size)
{
    ESP_UTILS_LOG_TRACE_ENTER_WITH_THIS();

    ESP_UTILS_CHECK_FALSE_RETURN(!isOverState(State::INIT), false, "Should be called before `init()`");
    ESP_UTILS_CHECK_FALSE_RETURN(isBusValid(), false, "Invalid bus");
#if ESP_PANEL_DRIVERS_BUS_ENABLE_RGB
    ESP_UTILS_CHECK_FALSE_RETURN(
        (getBus()->getBasicAttributes().type != ESP_PANEL_BUS_TYPE_RGB) ||
        static_cast<BusRGB *>(getBus())->getConfig().control_panel.has_value(), false,
        "Doesn't support the single \"RGB\" bus"
    );
#endif // ESP_PANEL_DRIVERS_BUS_ENABLE_RGB

    ESP_UTILS_LOGD("Param: init_cmd(@%p), init_cmd_size(%d)", init_cmd, static_cast<int>(init_cmd_size));
    ESP_UTILS_CHECK_FALSE_RETURN((init_cmd == nullptr) || (init_cmd_size > 0), false, "Invalid arguments");

    auto &vendor_config = getVendorFullConfig();
    vendor_config.init_cmds = init_cmd;
    vendor_config.init_cmds_size = init_cmd_size;

    ESP_UTILS_LOG_TRACE_EXIT_WITH_THIS();

    return true;
}

bool LCD::configMirrorByCommand(bool en)
{
    ESP_UTILS_LOG_TRACE_ENTER_WITH_THIS();

    ESP_UTILS_CHECK_FALSE_RETURN(!isOverState(State::INIT), false, "Should be called before `init()`");
    ESP_UTILS_CHECK_FALSE_RETURN(isBusValid(), false, "Invalid bus");
#if ESP_PANEL_DRIVERS_BUS_ENABLE_RGB
    ESP_UTILS_CHECK_FALSE_RETURN(
        (getBus()->getBasicAttributes().type == ESP_PANEL_BUS_TYPE_RGB) &&
        static_cast<BusRGB *>(getBus())->getConfig().control_panel.has_value(), false,
        "Only valid for the \"3-wire SPI + RGB\" bus"
    );

    ESP_UTILS_LOGD("Param: en(%d)", en);
    getVendorFullConfig().flags.mirror_by_cmd = en;
#else
    ESP_UTILS_CHECK_FALSE_RETURN(false, false, "This function is not supported");
#endif // ESP_PANEL_DRIVERS_BUS_ENABLE_RGB

    ESP_UTILS_LOG_TRACE_EXIT_WITH_THIS();

    return true;
}

bool LCD::configEnableIO_Multiplex(bool en)
{
    ESP_UTILS_LOG_TRACE_ENTER_WITH_THIS();

    ESP_UTILS_CHECK_FALSE_RETURN(!isOverState(State::INIT), false, "Should be called before `init()`");
    ESP_UTILS_CHECK_FALSE_RETURN(isBusValid(), false, "Invalid bus");
#if ESP_PANEL_DRIVERS_BUS_ENABLE_RGB
    ESP_UTILS_CHECK_FALSE_RETURN(
        (getBus()->getBasicAttributes().type == ESP_PANEL_BUS_TYPE_RGB) &&
        static_cast<BusRGB *>(getBus())->getConfig().control_panel.has_value(), false,
        "Only valid for the \"3-wire SPI + RGB\" bus"
    );

    ESP_UTILS_LOGD("Param: en(%d)", en);
    getVendorFullConfig().flags.enable_io_multiplex = en;
#else
    ESP_UTILS_CHECK_FALSE_RETURN(false, false, "This function is not supported");
#endif // ESP_PANEL_DRIVERS_BUS_ENABLE_RGB

    ESP_UTILS_LOG_TRACE_EXIT_WITH_THIS();

    return true;
}

bool LCD::configColorRGB_Order(bool reverse_order)
{
    ESP_UTILS_LOG_TRACE_ENTER_WITH_THIS();

    ESP_UTILS_CHECK_FALSE_RETURN(!isOverState(State::INIT), false, "Should be called before `init()`");
    ESP_UTILS_CHECK_FALSE_RETURN(isBusValid(), false, "Invalid bus");
    ESP_UTILS_LOGD("Param: reverse_order(%d)", reverse_order);
    if (reverse_order) {
        getDeviceFullConfig().rgb_ele_order = LCD_RGB_ELEMENT_ORDER_BGR;
    } else {
        getDeviceFullConfig().rgb_ele_order = LCD_RGB_ELEMENT_ORDER_RGB;
    }

    ESP_UTILS_LOG_TRACE_EXIT_WITH_THIS();

    return true;
}

bool LCD::configResetActiveLevel(int level)
{
    ESP_UTILS_LOG_TRACE_ENTER_WITH_THIS();

    ESP_UTILS_CHECK_FALSE_RETURN(!isOverState(State::INIT), false, "Should be called before `init()`");

    ESP_UTILS_LOGD("Param: level(%d)", level);
    getDeviceFullConfig().flags.reset_active_high = level;

    return true;
}

bool LCD::configFrameBufferNumber(int num)
{
    ESP_UTILS_LOG_TRACE_ENTER_WITH_THIS();

    ESP_UTILS_CHECK_FALSE_RETURN(!isOverState(State::INIT), false, "Should be called before `init()`");
    ESP_UTILS_CHECK_FALSE_RETURN(isBusValid(), false, "Invalid bus");

    ESP_UTILS_LOGD("Param: num(%d)", num);
    ESP_UTILS_CHECK_FALSE_RETURN(num > 0, false, "Invalid number");

    auto bus_type = getBus()->getBasicAttributes().type;
    switch (bus_type) {
#if ESP_PANEL_DRIVERS_BUS_ENABLE_RGB
    case ESP_PANEL_BUS_TYPE_RGB: {
        ESP_UTILS_CHECK_FALSE_RETURN(
            static_cast<BusRGB *>(getBus())->configRGB_FrameBufferNumber(num), false,
            "Config RGB frame buffer number failed"
        );
        break;
    }
#endif // ESP_PANEL_DRIVERS_BUS_ENABLE_RGB
#if ESP_PANEL_DRIVERS_BUS_ENABLE_MIPI_DSI
    case ESP_PANEL_BUS_TYPE_MIPI_DSI: {
        ESP_UTILS_CHECK_FALSE_RETURN(
            static_cast<BusDSI *>(getBus())->configDPI_FrameBufferNumber(num), false,
            "Config DPI frame buffer number failed"
        );
        break;
    }
#endif // ESP_PANEL_DRIVERS_BUS_ENABLE_MIPI_DSI
    default:
        ESP_UTILS_CHECK_FALSE_RETURN(false, false, "This function is not supported");
    }

    ESP_UTILS_LOG_TRACE_EXIT_WITH_THIS();

    return true;
}

bool LCD::begin()
{
    ESP_UTILS_LOG_TRACE_ENTER_WITH_THIS();

    ESP_UTILS_CHECK_FALSE_RETURN(!isOverState(State::BEGIN), false, "Already begun");
    ESP_UTILS_CHECK_FALSE_RETURN(isBusValid(), false, "Invalid bus");

    // Initialize the LCD if not initialized
    if (!isOverState(State::INIT)) {
        ESP_UTILS_CHECK_FALSE_RETURN(init(), false, "Init failed");
    }

    /* Reset the panel before initializing */
    ESP_UTILS_CHECK_FALSE_RETURN(reset(), false, "Reset failed");

    /* Initialize refresh panel */
    ESP_UTILS_CHECK_ERROR_RETURN(esp_lcd_panel_init(refresh_panel), false, "Init panel failed");
    ESP_UTILS_LOGD("Refresh panel(@%p) initialized", refresh_panel);

    auto bus_type = getBus()->getBasicAttributes().type;
    /* If the panel is reset, goto end directly */
    if (isOverState(State::RESET)) {
        goto end;
    }

    /* For non-RGB bus, create Semaphore for `drawBitmap()` to wait for finish */
    if ((bus_type != ESP_PANEL_BUS_TYPE_RGB) && (_interruption.draw_bitmap_finish_sem == nullptr)) {
        _interruption.on_draw_bitmap_finish_sem_buffer = utils::make_shared<StaticSemaphore_t>();
        ESP_UTILS_CHECK_NULL_RETURN(
            _interruption.on_draw_bitmap_finish_sem_buffer, false, "Create draw bitmap finish semaphore failed"
        );
        _interruption.draw_bitmap_finish_sem =
            xSemaphoreCreateBinaryStatic(_interruption.on_draw_bitmap_finish_sem_buffer.get());
    }

    /*  Register callback for different bus */
    _interruption.data.lcd_ptr = this;
    switch (bus_type) {
#if ESP_PANEL_DRIVERS_BUS_ENABLE_RGB
    case ESP_PANEL_BUS_TYPE_RGB: {
        auto rgb_config = getBusRGB_RefreshPanelFullConfig();
        ESP_UTILS_CHECK_NULL_RETURN(rgb_config, false, "Invalid RGB config");

        esp_lcd_rgb_panel_event_callbacks_t rgb_event_cb = {};
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 4, 0)
        rgb_event_cb.on_frame_buf_complete = (esp_lcd_rgb_panel_frame_buf_complete_cb_t)onRefreshFinish;
#else
        if (rgb_config->bounce_buffer_size_px == 0) {
            // When bounce buffer is disabled, use `on_vsync` callback to notify draw bitmap finish
            rgb_event_cb.on_vsync = (esp_lcd_rgb_panel_vsync_cb_t)onRefreshFinish;
        } else {
            // When bounce buffer is enabled, use `on_bounce_frame_finish` callback to notify draw bitmap finish
            rgb_event_cb.on_bounce_frame_finish = (esp_lcd_rgb_panel_bounce_buf_finish_cb_t)onRefreshFinish;
        }
#endif
        ESP_UTILS_CHECK_ERROR_RETURN(
            esp_lcd_rgb_panel_register_event_callbacks(refresh_panel, &rgb_event_cb, &_interruption.data), false,
            "Register RGB event callback failed"
        );
        break;
    }
#endif
#if ESP_PANEL_DRIVERS_BUS_ENABLE_MIPI_DSI
    case ESP_PANEL_BUS_TYPE_MIPI_DSI: {
        esp_lcd_dpi_panel_event_callbacks_t dpi_event_cb = {
            .on_color_trans_done = (esp_lcd_dpi_panel_color_trans_done_cb_t)onDrawBitmapFinish,
            .on_refresh_done = (esp_lcd_dpi_panel_refresh_done_cb_t)onRefreshFinish,
        };
        ESP_UTILS_CHECK_ERROR_RETURN(
            esp_lcd_dpi_panel_register_event_callbacks(refresh_panel, &dpi_event_cb, &_interruption.data), false,
            "Register MIPI-DSI event callback failed"
        );
        break;
    }
#endif
    default:
        esp_lcd_panel_io_callbacks_t io_cb = {
            .on_color_trans_done = (esp_lcd_panel_io_color_trans_done_cb_t)onDrawBitmapFinish,
        };
        ESP_UTILS_CHECK_ERROR_RETURN(
            esp_lcd_panel_io_register_event_callbacks(getBus()->getControlPanelHandle(), &io_cb, &_interruption.data),
            false, "Register control panel event callback failed"
        );
        break;
    }

end:
    setState(State::BEGIN);

    ESP_UTILS_LOG_TRACE_EXIT_WITH_THIS();

