openshwprojects/OpenBK7231T_App/src/libraries/ESP32_Display_Panel/src/drivers/lcd/esp_panel_lcd.cpp
    return true;
}

bool LCD::reset()
{
    ESP_UTILS_LOG_TRACE_ENTER_WITH_THIS();

    ESP_UTILS_CHECK_FALSE_RETURN(isOverState(State::INIT), false, "Not initialized");

    // For RGB bus, if the flag `enable_io_multiplex` is enabled, when the panel is not begun, ignore reset
    if ((getBus()->getBasicAttributes().type == ESP_PANEL_BUS_TYPE_RGB) && !isOverState(State::BEGIN) &&
            getConfig().getVendorFullConfig()->flags.enable_io_multiplex) {
        ESP_UTILS_LOGW("Ignore `reset()` before `begin()` when using RGB bus with flag `enable_io_multiplex` enabled");
        goto end;
    }

    ESP_UTILS_CHECK_ERROR_RETURN(esp_lcd_panel_reset(refresh_panel), false, "Reset panel failed");
    ESP_UTILS_LOGD("Refresh panel(@%p) reset", refresh_panel);

end:
    // If not begun, only reset the panel, not reset the state
    if (isOverState(State::BEGIN)) {
        setState(State::RESET);
    }

    ESP_UTILS_LOG_TRACE_EXIT_WITH_THIS();

    return true;
}

bool LCD::del()
{
    ESP_UTILS_LOG_TRACE_ENTER_WITH_THIS();

    if (refresh_panel != nullptr) {
        ESP_UTILS_CHECK_ERROR_RETURN(
            esp_lcd_panel_del(refresh_panel), false, "Delete refresh panel(@%p) failed", refresh_panel
        );
        ESP_UTILS_LOGD("Refresh panel(@%p) deleted", refresh_panel);
        refresh_panel = nullptr;
    }

    _transformation = {};
    _interruption = {};

    setState(State::DEINIT);

    ESP_UTILS_LOG_TRACE_EXIT_WITH_THIS();

    return true;
}

bool LCD::drawBitmap(int x_start, int y_start, int width, int height, const uint8_t *color_data, int timeout_ms)
{
    ESP_UTILS_LOG_TRACE_ENTER_WITH_THIS();

    ESP_UTILS_CHECK_FALSE_RETURN(isOverState(State::BEGIN), false, "Not begun");

    ESP_UTILS_LOGD(
        "Param: x_start(%d), y_start(%d), width(%d), height(%d), color_data(@%p), timeout_ms(%d)",
        x_start, y_start, width, height, color_data, timeout_ms
    );

    // Check basic parameters validity
    ESP_UTILS_CHECK_FALSE_RETURN(
        (x_start >= 0) && (y_start >= 0), false, "Invalid start coordinates: (%d,%d)", x_start, y_start
    );
    ESP_UTILS_CHECK_FALSE_RETURN((width >= 0) && (height >= 0), false, "Invalid dimensions: (%d,%d)", width, height);
    ESP_UTILS_CHECK_FALSE_RETURN(
        ((width == 0) && (height == 0)) || (color_data != nullptr), false, "Invalid color_data"
    );

    // Get display parameters
    auto swap_xy = getTransformation().swap_xy;
    auto frame_width = getFrameWidth();
    auto frame_height = getFrameHeight();
    auto x_align = getBasicAttributes().basic_bus_spec.x_coord_align;
    auto y_align = getBasicAttributes().basic_bus_spec.y_coord_align;
    auto x_end = x_start + width;
    auto y_end = y_start + height;

    // Check boundary limits
    auto max_x = swap_xy ? frame_height : frame_width;
    auto max_y = swap_xy ? frame_width : frame_height;
    if (frame_width > 0) {
        ESP_UTILS_CHECK_FALSE_RETURN(x_end <= max_x, false, "x_end(%d) exceeds display limit(%d)", x_end, max_x);
    }
    if (frame_height > 0) {
        ESP_UTILS_CHECK_FALSE_RETURN(y_end <= max_y, false, "y_end(%d) exceeds display limit(%d)", y_end, max_y);
    }

    // Check coordinate alignment
    if (x_start & (x_align - 1)) {
        ESP_UTILS_LOGW("x_start(%d) not aligned to %d", x_start, x_align);
    } else if (width & (x_align - 1)) {
        ESP_UTILS_LOGW("width(%d) not aligned to %d", width, x_align);
    }
    if (y_start & (y_align - 1)) {
        ESP_UTILS_LOGW("y_start(%d) not aligned to %d", y_start, y_align);
    } else if (height & (y_align - 1)) {
        ESP_UTILS_LOGW("height(%d) not aligned to %d", height, y_align);
    }

    // Send data to the panel
    ESP_UTILS_CHECK_ERROR_RETURN(
        esp_lcd_panel_draw_bitmap(refresh_panel, x_start, y_start, x_end, y_end, color_data), false,
        "Draw bitmap failed"
    );

    // For RGB bus, since `drawBitmap()` uses `memcpy()` instead of DMA operation, doesn't need to wait for finish
    if ((getBus()->getBasicAttributes().type == ESP_PANEL_BUS_TYPE_RGB) &&
            (_interruption.on_draw_bitmap_finish != nullptr)) {
        _interruption.on_draw_bitmap_finish(_interruption.data.user_data);
    }
    /* Otherwise, wait for the semaphore to be given by the callback function */
    if ((_interruption.draw_bitmap_finish_sem != nullptr) && (timeout_ms != 0)) {
        BaseType_t timeout_tick = (timeout_ms < 0) ? portMAX_DELAY : pdMS_TO_TICKS(timeout_ms);
        ESP_UTILS_CHECK_FALSE_RETURN(
            xSemaphoreTake(_interruption.draw_bitmap_finish_sem, timeout_tick) == pdTRUE, false,
            "Draw bitmap wait for finish timeout"
        );
    }

    ESP_UTILS_LOG_TRACE_EXIT_WITH_THIS();

    return true;
}

bool LCD::mirrorX(bool en)
{
    ESP_UTILS_LOG_TRACE_ENTER_WITH_THIS();

    ESP_UTILS_CHECK_FALSE_RETURN(isOverState(State::INIT), false, "Not initialized");
    ESP_UTILS_CHECK_FALSE_RETURN(
        isFunctionSupported(BasicBusSpecification::FUNC_MIRROR_X), false, "This function is not supported"
    );

    ESP_UTILS_LOGD("Param: en(%d)", en);
    ESP_UTILS_CHECK_ERROR_RETURN(
        esp_lcd_panel_mirror(refresh_panel, en, _transformation.mirror_y), false, "Mirror X failed"
    );
    _transformation.mirror_x = en;

    ESP_UTILS_LOG_TRACE_EXIT_WITH_THIS();

    return true;
}

bool LCD::mirrorY(bool en)
{
    ESP_UTILS_LOG_TRACE_ENTER_WITH_THIS();

    ESP_UTILS_CHECK_FALSE_RETURN(isOverState(State::INIT), false, "Not initialized");
    ESP_UTILS_CHECK_FALSE_RETURN(
        isFunctionSupported(BasicBusSpecification::FUNC_MIRROR_Y), false, "This function is not supported"
    );

    ESP_UTILS_LOGD("Param: en(%d)", en);
    ESP_UTILS_CHECK_ERROR_RETURN(
        esp_lcd_panel_mirror(refresh_panel, _transformation.mirror_x, en), false, "Mirror X failed"
    );
    _transformation.mirror_y = en;

    ESP_UTILS_LOG_TRACE_EXIT_WITH_THIS();

    return true;
}

bool LCD::swapXY(bool en)
{
    ESP_UTILS_LOG_TRACE_ENTER_WITH_THIS();

    ESP_UTILS_CHECK_FALSE_RETURN(isOverState(State::INIT), false, "Not initialized");
    ESP_UTILS_CHECK_FALSE_RETURN(
        isFunctionSupported(BasicBusSpecification::FUNC_SWAP_XY), false, "This function is not supported"
    );

    ESP_UTILS_LOGD("Param: en(%d)", en);
    ESP_UTILS_CHECK_ERROR_RETURN(esp_lcd_panel_swap_xy(refresh_panel, en), false, "Swap XY failed");
    _transformation.swap_xy = en;

    ESP_UTILS_LOG_TRACE_EXIT_WITH_THIS();

