openshwprojects/OpenBK7231T_App/src/libraries/ESP32_Display_Panel/src/drivers/lcd/esp_panel_lcd.cpp
    return true;
}

bool LCD::setGapX(uint16_t gap)
{
    ESP_UTILS_LOG_TRACE_ENTER_WITH_THIS();

    ESP_UTILS_CHECK_FALSE_RETURN(isOverState(State::INIT), false, "Not initialized");
    ESP_UTILS_CHECK_FALSE_RETURN(
        isFunctionSupported(BasicBusSpecification::FUNC_GAP), false, "This function is not supported"
    );

    ESP_UTILS_LOGD("Param: gap(%d)", static_cast<int>(gap));
    ESP_UTILS_CHECK_ERROR_RETURN(
        esp_lcd_panel_set_gap(refresh_panel, gap, _transformation.gap_y), false, "Set X gap failed"
    );
    _transformation.gap_x = gap;

    ESP_UTILS_LOG_TRACE_EXIT_WITH_THIS();

    return true;
}

bool LCD::setGapY(uint16_t gap)
{
    ESP_UTILS_LOG_TRACE_ENTER_WITH_THIS();

    ESP_UTILS_CHECK_FALSE_RETURN(isOverState(State::INIT), false, "Not initialized");
    ESP_UTILS_CHECK_FALSE_RETURN(
        isFunctionSupported(BasicBusSpecification::FUNC_GAP), false, "This function is not supported"
    );

    ESP_UTILS_LOGD("Param: gap(%d)", gap);
    ESP_UTILS_CHECK_ERROR_RETURN(
        esp_lcd_panel_set_gap(refresh_panel, _transformation.gap_x, gap), false, "Set Y gap failed"
    );
    _transformation.gap_y = gap;

    ESP_UTILS_LOG_TRACE_EXIT_WITH_THIS();

    return true;
}

bool LCD::invertColor(bool en)
{
    ESP_UTILS_LOG_TRACE_ENTER_WITH_THIS();

    ESP_UTILS_CHECK_FALSE_RETURN(isOverState(State::INIT), false, "Not initialized");
    ESP_UTILS_CHECK_FALSE_RETURN(
        isFunctionSupported(BasicBusSpecification::FUNC_INVERT_COLOR), false, "This function is not supported"
    );

    ESP_UTILS_LOGD("Param: en(%d)", en);
    ESP_UTILS_CHECK_ERROR_RETURN(esp_lcd_panel_invert_color(refresh_panel, en), false, "Invert color failed");

    ESP_UTILS_LOG_TRACE_EXIT_WITH_THIS();

    return true;
}

bool LCD::setDisplayOnOff(bool enable_on)
{
    ESP_UTILS_LOG_TRACE_ENTER_WITH_THIS();

    ESP_UTILS_CHECK_FALSE_RETURN(isOverState(State::INIT), false, "Not initialized");
    ESP_UTILS_CHECK_FALSE_RETURN(
        isFunctionSupported(BasicBusSpecification::FUNC_DISPLAY_ON_OFF), false, "This function is not supported"
    );

    ESP_UTILS_LOGD("Param: enable_on(%d)", enable_on);
    ESP_UTILS_CHECK_ERROR_RETURN(
        esp_lcd_panel_disp_on_off(refresh_panel, enable_on), false, "Set display on/off failed"
    );

    ESP_UTILS_LOG_TRACE_EXIT_WITH_THIS();

    return true;
}

bool LCD::attachDrawBitmapFinishCallback(FunctionDrawBitmapFinishCallback callback, void *user_data)
{
    ESP_UTILS_LOG_TRACE_ENTER_WITH_THIS();

    ESP_UTILS_LOGD("Param: callback(@%p), user_data(@%p)", callback, user_data);
    if ((_interruption.data.user_data != nullptr) && (_interruption.data.user_data != user_data)) {
        ESP_UTILS_LOGW("The previous user_data(@%p) is existed, will overwrite it", _interruption.data.user_data);
    }
    _interruption.data.user_data = user_data;
    _interruption.on_draw_bitmap_finish = callback;

    ESP_UTILS_LOG_TRACE_EXIT_WITH_THIS();

    return true;
}

bool LCD::attachRefreshFinishCallback(FunctionRefreshFinishCallback callback, void *user_data)
{
    ESP_UTILS_LOG_TRACE_ENTER_WITH_THIS();

    auto bus_type = getBus()->getBasicAttributes().type;
    ESP_UTILS_CHECK_FALSE_RETURN(
        (bus_type == ESP_PANEL_BUS_TYPE_RGB) || (bus_type == ESP_PANEL_BUS_TYPE_MIPI_DSI), false,
        "Only valid for RGB and MIPI-DSI bus"
    );

    ESP_UTILS_LOGD("Param: callback(@%p), user_data(@%p)", callback, user_data);

    /* Check the callback function and user data placement */
    // For MIPI-DSI bus, when `CONFIG_LCD_DSI_ISR_IRAM_SAFE` is set, the callback function and user data should be
    // placed in SRAM
    // For RGB bus, when `CONFIG_LCD_RGB_ISR_IRAM_SAFE` is set, if the "XIP on PSRAM" function is not enabled, the
    // callback function and user data should be placed in SRAM
#if (ESP_PANEL_DRIVERS_BUS_ENABLE_MIPI_DSI && defined(CONFIG_LCD_DSI_ISR_IRAM_SAFE)) || \
    (ESP_PANEL_DRIVERS_BUS_ENABLE_RGB && defined(CONFIG_LCD_RGB_ISR_IRAM_SAFE) && \
    !(defined(CONFIG_SPIRAM_RODATA) && defined(CONFIG_SPIRAM_FETCH_INSTRUCTIONS)))
    if (bus_type == ESP_PANEL_BUS_TYPE_RGB || bus_type == ESP_PANEL_BUS_TYPE_MIPI_DSI) {
        ESP_UTILS_CHECK_FALSE_RETURN(
            esp_ptr_in_iram(reinterpret_cast<const void *>(callback)), false,
            "Callback function should be placed in IRAM, add `IRAM_ATTR` before the function"
        );
        ESP_UTILS_CHECK_FALSE_RETURN(
            esp_ptr_internal(user_data), false, "User data should be placed in SRAM, add `DRAM_ATTR` before the data"
        );
    }
#endif

    if ((_interruption.data.user_data != nullptr) && (_interruption.data.user_data != user_data)) {
        ESP_UTILS_LOGW("The previous user_data(@%p) is existed, will overwrite it", _interruption.data.user_data);
    }
    _interruption.data.user_data = user_data;
    _interruption.on_refresh_finish = callback;

    ESP_UTILS_LOG_TRACE_EXIT_WITH_THIS();

    return true;
}

bool LCD::switchFrameBufferTo(void *frame_buffer)
{
    ESP_UTILS_LOG_TRACE_ENTER_WITH_THIS();

    ESP_UTILS_CHECK_FALSE_RETURN(isOverState(State::BEGIN), false, "Not begun");
    ESP_UTILS_CHECK_FALSE_RETURN(
        (getBus()->getBasicAttributes().type == ESP_PANEL_BUS_TYPE_RGB) ||
        (getBus()->getBasicAttributes().type == ESP_PANEL_BUS_TYPE_MIPI_DSI),
        false, "Only valid for RGB and MIPI-DSI bus"
    );

    ESP_UTILS_LOGD("Param: frame_buffer(@%p)", frame_buffer);

    ESP_UTILS_CHECK_ERROR_RETURN(
        esp_lcd_panel_draw_bitmap(refresh_panel, 0, 0, getFrameWidth(), getFrameHeight(), frame_buffer), false,
        "Switch to frame buffer failed"
    );

    ESP_UTILS_LOG_TRACE_EXIT_WITH_THIS();

    return true;
}

bool LCD::colorBarTest(uint16_t width, uint16_t height)
{
    ESP_UTILS_LOG_TRACE_ENTER_WITH_THIS();

    ESP_UTILS_CHECK_FALSE_RETURN(isOverState(State::BEGIN), false, "Not begun");

    int bits_per_piexl = getFrameColorBits();
    ESP_UTILS_LOGD("LCD bits per pixel: %d", bits_per_piexl);
    ESP_UTILS_CHECK_FALSE_RETURN(bits_per_piexl > 0, false, "Invalid color bits");

