openshwprojects/OpenBK7231T_App/src/libraries/ESP32_Display_Panel/src/drivers/lcd/esp_panel_lcd.cpp
    ESP_UTILS_LOGD("Param: width(%d), height(%d)", width, height);

    auto y_coord_align = getBasicAttributes().basic_bus_spec.y_coord_align;
    int bytes_per_piexl = bits_per_piexl / 8;
    // Make sure the height is aligned to the `y_coord_align`
    int row_per_bar = (height / bits_per_piexl) & ~(y_coord_align - 1);
    int line_count = 0;
    int res_line_count = 0;

    /* Malloc memory for a single color bar */
    utils::vector<uint8_t> single_bar(row_per_bar * width * bytes_per_piexl);
    auto single_bar_buf = single_bar.data();
    auto bus_type = getBus()->getBasicAttributes().type;
    /* Draw color bar from top left to bottom right, the order is B - G - R */
    for (int j = 0; j < bits_per_piexl; j++) {
        for (int i = 0; i < row_per_bar * width; i++) {
            for (int k = 0; k < bytes_per_piexl; k++) {
                if ((bus_type == ESP_PANEL_BUS_TYPE_SPI) || (bus_type == ESP_PANEL_BUS_TYPE_QSPI)) {
                    // For SPI bus, the data bytes should be swapped since the data is sent by LSB first
                    single_bar_buf[i * bytes_per_piexl + k] = SPI_SWAP_DATA_TX(BIT(j), bits_per_piexl) >> (k * 8);
                } else {
                    single_bar_buf[i * bytes_per_piexl + k] = BIT(j) >> (k * 8);
                }
            }
        }
        line_count += row_per_bar;
        ESP_UTILS_CHECK_FALSE_RETURN(
            drawBitmap(0, j * row_per_bar, width, row_per_bar, single_bar_buf, -1), false,
            "Draw bitmap wait until finish failed"
        );
    }

    /* Fill the rest of the screen with white color */
    res_line_count = height - line_count;
    if (res_line_count > 0) {
        ESP_UTILS_LOGD("Fill the rest lines(%d) with white color", res_line_count);
        memset(single_bar_buf, 0xff, row_per_bar * width * bytes_per_piexl);

        for (; res_line_count > 0; res_line_count -= row_per_bar) {
            ESP_UTILS_CHECK_FALSE_RETURN(
                drawBitmap(
                    0, line_count, width, res_line_count > row_per_bar ? row_per_bar : res_line_count,
                    single_bar_buf, -1
                ), false, "Draw bitmap wait until finish failed"
            );
            line_count += row_per_bar;
        }
    }

    ESP_UTILS_LOG_TRACE_EXIT_WITH_THIS();

    return true;
}

bool LCD::colorBarTest()
{
    ESP_UTILS_LOG_TRACE_ENTER_WITH_THIS();

    ESP_UTILS_CHECK_FALSE_RETURN(colorBarTest(getFrameWidth(), getFrameHeight()), false, "Color bar test failed");

    ESP_UTILS_LOG_TRACE_EXIT_WITH_THIS();

    return true;
}

#if ESP_PANEL_DRIVERS_BUS_ENABLE_MIPI_DSI
bool LCD::DSI_ColorBarPatternTest(DSI_ColorBarPattern pattern)
{
    ESP_UTILS_LOG_TRACE_ENTER_WITH_THIS();

    ESP_UTILS_CHECK_FALSE_RETURN(isOverState(State::BEGIN), false, "Not begun");
    ESP_UTILS_CHECK_FALSE_RETURN(
        getBus()->getBasicAttributes().type == ESP_PANEL_BUS_TYPE_MIPI_DSI, false, "Only valid for MIPI-DSI bus"
    );

    ESP_UTILS_LOGD("Param: pattern(%d)", static_cast<int>(pattern));
    ESP_UTILS_CHECK_ERROR_RETURN(
        esp_lcd_dpi_panel_set_pattern(refresh_panel, static_cast<mipi_dsi_pattern_type_t>(pattern)), false,
        "Set MIPI DPI pattern failed"
    );

    ESP_UTILS_LOG_TRACE_EXIT_WITH_THIS();

    return true;
}
#endif /* ESP_PANEL_DRIVERS_BUS_ENABLE_MIPI_DSI */

int LCD::getFrameColorBits()
{
    ESP_UTILS_LOG_TRACE_ENTER_WITH_THIS();

    ESP_UTILS_CHECK_FALSE_RETURN(isBusValid(), -1, "Invalid bus");

    int bits_per_pixel = -1;
    switch (getBus()->getBasicAttributes().type) {
#if ESP_PANEL_DRIVERS_BUS_ENABLE_RGB
    case ESP_PANEL_BUS_TYPE_RGB: {
        auto rgb_config = getBusRGB_RefreshPanelFullConfig();
        ESP_UTILS_CHECK_NULL_RETURN(rgb_config, -1, "Invalid RGB config");

        bits_per_pixel = rgb_config->bits_per_pixel;
        break;
    }
#endif // ESP_PANEL_DRIVERS_BUS_ENABLE_RGB
#if ESP_PANEL_DRIVERS_BUS_ENABLE_MIPI_DSI
    case ESP_PANEL_BUS_TYPE_MIPI_DSI: {
        auto dpi_config = getBusDSI_RefreshPanelFullConfig();
        ESP_UTILS_CHECK_NULL_RETURN(dpi_config, -1, "Invalid MIPI DPI config");

        switch (dpi_config->pixel_format) {
        case LCD_COLOR_PIXEL_FORMAT_RGB565:
            bits_per_pixel = 16;
            break;
        case LCD_COLOR_PIXEL_FORMAT_RGB666:
            bits_per_pixel = 18;
            break;
        case LCD_COLOR_PIXEL_FORMAT_RGB888:
            bits_per_pixel = 24;
            break;
        default:
            bits_per_pixel = getConfig().getDeviceFullConfig()->bits_per_pixel;
            break;
        }
        break;
    }
#endif /* ESP_PANEL_DRIVERS_BUS_ENABLE_MIPI_DSI */
    default:
        bits_per_pixel = getConfig().getDeviceFullConfig()->bits_per_pixel;
        break;
    }

    ESP_UTILS_LOG_TRACE_EXIT_WITH_THIS();

    return bits_per_pixel;
}

void *LCD::getFrameBufferByIndex(uint8_t index)
{
    ESP_UTILS_LOG_TRACE_ENTER_WITH_THIS();

    ESP_UTILS_CHECK_FALSE_RETURN(isOverState(State::BEGIN), nullptr, "Not begun");

    ESP_UTILS_LOGD("Param: index(%d)", index);
    ESP_UTILS_CHECK_FALSE_RETURN(
        index < FRAME_BUFFER_MAX_NUM, nullptr, "Index out of range(0-%d)", FRAME_BUFFER_MAX_NUM - 1
    );

    auto bus_type = getBus()->getBasicAttributes().type;
    void *buffer[FRAME_BUFFER_MAX_NUM] = {};
    switch (bus_type) {
#if ESP_PANEL_DRIVERS_BUS_ENABLE_RGB
    case ESP_PANEL_BUS_TYPE_RGB:
        ESP_UTILS_CHECK_ERROR_RETURN(
            esp_lcd_rgb_panel_get_frame_buffer(refresh_panel, index + 1, &buffer[0], &buffer[1], &buffer[2]), nullptr,
            "Get RGB buffer failed"
        );
        break;
#endif
#if ESP_PANEL_DRIVERS_BUS_ENABLE_MIPI_DSI
    case ESP_PANEL_BUS_TYPE_MIPI_DSI:
        ESP_UTILS_CHECK_ERROR_RETURN(
            esp_lcd_dpi_panel_get_frame_buffer(refresh_panel, index + 1, &buffer[0], &buffer[1], &buffer[2]), nullptr,
            "Get MIPI DPI buffer failed"
        );
        break;
#endif
    default:
        ESP_UTILS_CHECK_FALSE_RETURN(
            false, nullptr, "Bus(%d[%s]) is invalid for this function", bus_type,
            BusFactory::getTypeNameString(bus_type).c_str()
        );
        break;
    }

    ESP_UTILS_LOG_TRACE_EXIT_WITH_THIS();

    return buffer[index];
}

bool LCD::processDeviceOnInit(const BasicBusSpecificationMap &bus_specs)
{
    ESP_UTILS_LOG_TRACE_ENTER_WITH_THIS();

