openshwprojects/OpenBK7231T_App/src/libraries/ESP32_Display_Panel/src/drivers/lcd/esp_panel_lcd.cpp
    ESP_UTILS_CHECK_FALSE_RETURN(!isOverState(State::INIT), false, "Should be called before `init()`");
    ESP_UTILS_CHECK_FALSE_RETURN(isBusValid(), false, "Invalid bus");

    // Begin the bus if it is not begun
    auto bus = getBus();
    if (!bus->isOverState(Bus::State::BEGIN)) {
        ESP_UTILS_CHECK_FALSE_RETURN(bus->begin(), false, "Bus begin failed");
    }

#if ESP_UTILS_CONF_LOG_LEVEL == ESP_UTILS_LOG_LEVEL_DEBUG
    // Print all bus specifications
    ESP_UTILS_LOGD("Print %s all supported bus specifications", _basic_attributes.name);
    for (const auto &bus_spec : bus_specs) {
        bus_spec.second.print(BusFactory::getTypeNameString(bus_spec.first));
    }
#endif // ESP_UTILS_LOG_LEVEL_DEBUG

    // Check if the bus is valid for the device and load the bus specification to the device
    auto bus_type = bus->getBasicAttributes().type;
    auto bus_specs_it = bus_specs.find(bus_type);
// *INDENT-OFF*
    ESP_UTILS_CHECK_FALSE_RETURN(
        bus_specs_it != bus_specs.end(), false,
        "Bus type(%d[%s]) is not supported for the device(%s: %s)", bus_type,
        BusFactory::getTypeNameString(bus_type).c_str(), _basic_attributes.name,
        std::accumulate(
            bus_specs.begin(), bus_specs.end(), utils::string(), [](const utils::string & a, const auto & b) {
                return a.empty() ? BusFactory::getTypeNameString(b.first) :
                                   a + ", " + BusFactory::getTypeNameString(b.first);
        }).c_str()
    );
// *INDENT-ON*
    _basic_attributes.basic_bus_spec = bus_specs_it->second;

    // Convert the device partial configuration to full configuration
    _config.convertPartialToFull();

    auto &bus_spec = _basic_attributes.basic_bus_spec;
// *INDENT-OFF*
    // When using the single RGB bus, the color bits of device configuration will be ignored, so skip the check
    if ((bus->getBasicAttributes().type != ESP_PANEL_BUS_TYPE_RGB) ||
        (bus->getControlPanelHandle() != nullptr)) {
        auto color_bits = bus_spec.getColorBitsVector();
        auto bits_per_pixel = _config.getDeviceFullConfig()->bits_per_pixel;

        // Check if the color bits is valid for the device
        ESP_UTILS_CHECK_FALSE_RETURN(
            std::find(color_bits.begin(), color_bits.end(), bits_per_pixel) != color_bits.end(), false,
            "Invalid color bits(%d), supported bits: %s", static_cast<int>(bits_per_pixel),
            bus_spec.getColorBitsString().c_str()
        );
    }
// *INDENT-ON*

#if ESP_PANEL_DRIVERS_BUS_ENABLE_RGB
    // When using RGB bus, if the bus doesn't support the `display_on_off` function, disable it
    if (bus_type == ESP_PANEL_BUS_TYPE_RGB) {
        auto rgb_config = getBusRGB_RefreshPanelFullConfig();
        ESP_UTILS_CHECK_NULL_RETURN(rgb_config, false, "Invalid RGB config");

        auto &vendor_config = getVendorFullConfig();
        if ((rgb_config->disp_gpio_num == -1) && ((bus->getControlPanelHandle() == nullptr) ||
                vendor_config.flags.enable_io_multiplex)) {
            ESP_UTILS_LOGD("Not support `display_on_off` function, disable it");
            bus_spec.functions.reset(static_cast<int>(BasicBusSpecification::FUNC_DISPLAY_ON_OFF));
        }
    }
#endif // ESP_PANEL_DRIVERS_BUS_ENABLE_RGB

    // Load the vendor configuration from the bus to the device
    ESP_UTILS_LOGD("Load vendor configuration from the bus");
    auto &vendor_config = getVendorFullConfig();
    switch (bus_type) {
    case ESP_PANEL_BUS_TYPE_SPI:
        vendor_config.flags.use_spi_interface = 1;
        break;
    case ESP_PANEL_BUS_TYPE_QSPI:
        vendor_config.flags.use_qspi_interface = 1;
        break;
#if ESP_PANEL_DRIVERS_BUS_ENABLE_RGB
    /* Retrieve RGB configuration from the bus and register it into the vendor configuration */
    case ESP_PANEL_BUS_TYPE_RGB: {
        auto rgb_config = getBusRGB_RefreshPanelFullConfig();
        ESP_UTILS_CHECK_NULL_RETURN(rgb_config, false, "Invalid RGB config");

        vendor_config.hor_res = rgb_config->timings.h_res;
        vendor_config.ver_res = rgb_config->timings.v_res;
        vendor_config.flags.use_rgb_interface = 1;
        vendor_config.rgb_config = rgb_config;
        break;
    }
#endif
#if ESP_PANEL_DRIVERS_BUS_ENABLE_MIPI_DSI
    /* Retrieve MIPI DPI configuration from the bus and register it into the vendor configuration */
    case ESP_PANEL_BUS_TYPE_MIPI_DSI: {
        auto bus = static_cast<BusDSI *>(getBus());
        ESP_UTILS_CHECK_FALSE_RETURN(
            std::holds_alternative<BusDSI::HostFullConfig>(bus->getConfig().host), false,
            "MIPI-DSI bus configuration is not full"
        );
        auto &host_config = std::get<BusDSI::HostFullConfig>(bus->getConfig().host);

        auto dpi_config = getBusDSI_RefreshPanelFullConfig();
        ESP_UTILS_CHECK_NULL_RETURN(dpi_config, false, "Invalid MIPI DPI config");

        vendor_config.hor_res = dpi_config->video_timing.h_size;
        vendor_config.ver_res = dpi_config->video_timing.v_size;
        vendor_config.flags.use_mipi_interface = 1;
        vendor_config.mipi_config = {
            .lane_num = host_config.num_data_lanes,
            .dsi_bus = bus->getHostHandle(),
            .dpi_config = dpi_config,
        };
        break;
    }
#endif
    default:
        ESP_UTILS_CHECK_FALSE_RETURN(
            false, false, "Bus(%d[%s]) is invalid for this function", bus_type,
            BusFactory::getTypeNameString(bus_type).c_str()
        );
        break;
    }

    // Bind the vendor configuration to the device configuration
    auto &device_config = getDeviceFullConfig();
    device_config.vendor_config = &vendor_config;

#if ESP_UTILS_CONF_LOG_LEVEL == ESP_UTILS_LOG_LEVEL_DEBUG
    _basic_attributes.print();
    _config.printVendorConfig();
    _config.printDeviceConfig();
#endif // ESP_UTILS_LOG_LEVEL_DEBUG

    ESP_UTILS_LOG_TRACE_EXIT_WITH_THIS();

    return true;
}

LCD::DeviceFullConfig &LCD::getDeviceFullConfig()
{
    if (!std::holds_alternative<DeviceFullConfig>(_config.device)) {
        _config.convertPartialToFull();
    }

    return std::get<DeviceFullConfig>(_config.device);
}

LCD::VendorFullConfig &LCD::getVendorFullConfig()
{
    if (!std::holds_alternative<VendorFullConfig>(_config.vendor)) {
        _config.convertPartialToFull();
    }

