openshwprojects/OpenBK7231T_App/src/libraries/ESP32_Display_Panel/src/drivers/lcd/esp_panel_lcd.cpp
    return std::get<VendorFullConfig>(_config.vendor);
}

#if ESP_PANEL_DRIVERS_BUS_ENABLE_RGB
const BusRGB::RefreshPanelFullConfig *LCD::getBusRGB_RefreshPanelFullConfig()
{
    ESP_UTILS_CHECK_FALSE_RETURN(isBusValid(), nullptr, "Invalid bus");

    auto bus = getBus();
    auto bus_type = bus->getBasicAttributes().type;
    ESP_UTILS_CHECK_FALSE_RETURN(
        bus_type == ESP_PANEL_BUS_TYPE_RGB, nullptr, "Invalid bus type(%d[%s])", bus_type,
        BusFactory::getTypeNameString(bus_type).c_str()
    );

    auto &config = static_cast<BusRGB *>(bus)->getConfig();
    ESP_UTILS_CHECK_FALSE_RETURN(
        std::holds_alternative<BusRGB::RefreshPanelFullConfig>(config.refresh_panel), nullptr, "Config is not full"
    );

    return &std::get<BusRGB::RefreshPanelFullConfig>(config.refresh_panel);
}
#endif

#if ESP_PANEL_DRIVERS_BUS_ENABLE_MIPI_DSI
const BusDSI::RefreshPanelFullConfig *LCD::getBusDSI_RefreshPanelFullConfig()
{
    ESP_UTILS_CHECK_FALSE_RETURN(isBusValid(), nullptr, "Invalid bus");

    auto bus = getBus();
    auto bus_type = bus->getBasicAttributes().type;
    ESP_UTILS_CHECK_FALSE_RETURN(
        bus_type == ESP_PANEL_BUS_TYPE_MIPI_DSI, nullptr, "Invalid bus type(%d[%s])", bus_type,
        BusFactory::getTypeNameString(bus_type).c_str()
    );

    auto &config = static_cast<BusDSI *>(bus)->getConfig();
    ESP_UTILS_CHECK_FALSE_RETURN(
        std::holds_alternative<BusDSI::RefreshPanelFullConfig>(config.refresh_panel), nullptr, "Config is not full"
    );

    return &std::get<BusDSI::RefreshPanelFullConfig>(config.refresh_panel);
}
#endif

IRAM_ATTR bool LCD::onDrawBitmapFinish(void *panel_io, void *edata, void *user_ctx)
{
    Interruption::CallbackData *callback_data = (Interruption::CallbackData *)user_ctx;
    if (callback_data == nullptr) {
        return false;
    }

    LCD *lcd_ptr = (LCD *)callback_data->lcd_ptr;
    if (lcd_ptr == nullptr) {
        return false;
    }

    BaseType_t need_yield = pdFALSE;
    if (lcd_ptr->_interruption.on_draw_bitmap_finish != nullptr) {
        need_yield =
            lcd_ptr->_interruption.on_draw_bitmap_finish(lcd_ptr->_interruption.data.user_data) ? pdTRUE : need_yield;
    }
    if (lcd_ptr->_interruption.draw_bitmap_finish_sem != nullptr) {
        xSemaphoreGiveFromISR(lcd_ptr->_interruption.draw_bitmap_finish_sem, &need_yield);
    }

    return (need_yield == pdTRUE);
}

IRAM_ATTR bool LCD::onRefreshFinish(void *panel_io, void *edata, void *user_ctx)
{
    Interruption::CallbackData *callback_data = (Interruption::CallbackData *)user_ctx;
    if (callback_data == nullptr) {
        return false;
    }

    LCD *lcd_ptr = (LCD *)callback_data->lcd_ptr;
    if (lcd_ptr == nullptr) {
        return false;
    }

    BaseType_t need_yield = pdFALSE;
    if (lcd_ptr->_interruption.on_refresh_finish != nullptr) {
        need_yield =
            lcd_ptr->_interruption.on_refresh_finish(lcd_ptr->_interruption.data.user_data) ? pdTRUE : need_yield;
    }

    return (need_yield == pdTRUE);
}

} // namespace esp_panel::drivers
